---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Electrical.CableTraySettings
source: html/0e90ceed-f1ee-9f7e-2632-cb432d7eaf1f.htm
---
# CableTraySettings Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.